export const FORM_PATTERNS = {
	required: {
		value: true,
		message: 'აუცილებელი ველი'
	},
	letters: {
		value: /^[ა-ჰA-Za-z]+$/,
		message: ' ველი უნდა შეიცავდეს მხოლოდ ანბანის ასოებს'
	},
	email: {
		//value: /^(([^<>()\[\]\\.,;:\s@"]+(\.[^<>()\[\]\\.,;:\s@"]+)*)|(".+"))@((\[[0-9]{1,3}\.[0-9]{1,3}\.[0-9]{1,3}\.[0-9]{1,3}])|(([a-zA-Z\-0-9]+\.)+[a-zA-Z]{2,}))$/,
		value: /([a-zA-Z0-9]+)([\.{1}])?([a-zA-Z0-9]+)\@redberry([\.])ge/,
		message: 'მეილის ფორმატი არასწორია'
	},
	number: {
		value: /^[0-9]*$/,
		message: 'შეიყვანეთ რიცხვითი მნიშნელობა'
	},
	date: {
		value: /^(0?[1-9]|[12][0-9]|3[01])[\/\-](0?[1-9]|1[012])[\/\-]\d{4}$/,
		message: 'ფორმატი აუცილებლად უნდა იყოს Date'

		// /^(?:(?:31(\/|-|\.)(?:0?[13578]|1[02]))\1|(?:(?:29|30)(\/|-|\.)(?:0?[13-9]|1[0-2])\2))(?:(?:1[6-9]|[2-9]\d)?\d{2})$|^(?:29(\/|-|\.)0?2\3(?:(?:(?:1[6-9]|[2-9]\d)?(?:0[48]|[2468][048]|[13579][26])|(?:(?:16|[2468][048]|[3579][26])00))))$|^(?:0?[1-9]|1\d|2[0-8])(\/|-|\.)(?:(?:0?[1-9])|(?:1[0-2]))\4(?:(?:1[6-9]|[2-9]\d)?\d{2})$/
	}
};

export const routPrefix = 'covid-questionnaire';
